In [44]:
import numpy as np
import pandas as pd

In [45]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [46]:
df.head(2)

   col1  col2 col3
0     1   444  abc
1     2   555  def

# Finding unique values

In [47]:
df['col2'].unique()

array([444, 555, 666])

In [48]:
# get the number of unique value
df['col2'].nunique()

3

In [49]:
# get value and corresoponsed frequency
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [50]:
df['col2'].value_counts()[444]

2

In [51]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [52]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [53]:
df['col1'] > 2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [54]:
df[(df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [55]:
type(df['col1'])

pandas.core.series.Series

In [56]:
type(df['col1'].value_counts())

pandas.core.series.Series

In [57]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Powerful Apply(method or lambda)

In [58]:
def times2(x):
    return x * 2

In [59]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [60]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [61]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [62]:
df['col2'].apply(lambda x : x * 2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [63]:
# potentially could add inplace = True
df.drop('col1', axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [64]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [65]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [66]:
df.index

RangeIndex(start=0, stop=4, step=1)

# Sorting

In [67]:
df.sort_values(by = 'col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

# Find Null Values or Check for Null Values

In [68]:
# Check if the value is null
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [69]:
# drop rows with null values
df.dropna()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [71]:
df1 = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df1.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [72]:
df1.fillna('FILL NaN')

       col1      col2 col3
0         1  FILL NaN  abc
1         2       555  def
2         3       666  ghi
3  FILL NaN       444  xyz

# Pivot Table

In [73]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df2 = pd.DataFrame(data)

In [74]:
df2

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [77]:
df2.pivot_table(values = 'D', index = ['A', 'B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [81]:
df2.pivot_table(values = 'D', index = ['A', 'B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN